backend/controllers/AdController.php

SELECT * FROM `qs_ad_category`
SELECT * FROM `qs_ad` JOIN `qs_ad_category` `c` ON qs_ad.category_id=c.c_id JOIN `qs_type` `t` ON qs_ad.type_id=t.t_id WHERE 1=1 LIMIT 3 OFFSET 3
SELECT COUNT(*) FROM `qs_ad` JOIN `qs_ad_category` `c` ON qs_ad.category_id=c.c_id JOIN `qs_type` `t` ON qs_ad.type_id=t.t_id WHERE 1=1
---
	public function actionIndex(){
		$deadline=isset($_GET['d_time'])?$_GET['d_time']:'';
		$is_display=isset($_GET['status'])?$_GET['status']:'';
		$category_id=isset($_GET['cate'])?$_GET['cate']:'';
		$where='1=1';
		// echo $is_display;die;
		if(!empty($deadline)||!empty($is_display)||!empty($category_id)){
			if($deadline!=0){
				$time=time();
				if($deadline==1){
					$where.=" and deadline<=$time";
				}else{
					$aa=$time+$deadline;
					$where.=" and deadline<=$aa";
				}
			}
			if($is_display!=0){
				$where.=" and is_display=$is_display";
			}
			if($category_id!=0){
				$where.=" and category_id=$category_id";
			}
		}
		// echo $where;die;
		$arr=Ad::find()->select('*')
		->join('JOIN','qs_ad_category as c','qs_ad.category_id=c.c_id')
		->join('JOIN','qs_type as t','qs_ad.type_id=t.t_id')->where($where);
		$pages = new Pagination([
			'totalCount' => $arr->count(),
			'pageSize'   => 3   //每页显示条数
		]);