backend/controllers/CompanyController.php

INSERT INTO `qs_company_profile` (`id`) VALUES (DEFAULT)
---
	public function actionCompanyadd_pro()
	{
		$data = Yii::$app->request->post();
		$model = new CompanyProfile;
		$model->setAttributes($data);
		if($model->save())