backend/controllers/IndexController.php

SELECT * FROM `qs_admin` WHERE (`admin_name`='admin') AND (`pwd`='21232f297a57a5a743894a0e4a801fc3')
---
	public function actionLogin_do()
    {
    	$username=Yii::$app->request->post('UserName');
    	$password=md5(Yii::$app->request->post('password'));
    	//echo $username.$password;die;
    	$result=Admin::find()->where(['admin_name'=>$username,'pwd'=>$password])->one();