backend/controllers/MyController.php

SELECT * FROM `qs_admin` JOIN `qs_admin_role` `ar` ON qs_admin.admin_id = ar.admin_id JOIN `qs_role` `r` ON ar.role_id = r.role_id JOIN `qs_role_power` `rp` ON r.role_id = rp.role_id JOIN `qs_power` `p` ON rp.power_id = p.power_id WHERE `qs_admin`.`admin_name`='admin'
---
	public function actionRbac()
	{
		$requestedRoute = $this->module->requestedRoute;
		$gang = strpos($requestedRoute,'/');
		$controller = $this->id;
		$method = substr($requestedRoute,$gang+1);
		$uname = Yii::$app->session['uname'];
		//根据用户名查询相关权限
		$re = Admin::find()
		->select('*')
		->join('JOIN','qs_admin_role as ar','qs_admin.admin_id = ar.admin_id')
		->join('JOIN','qs_role as r','ar.role_id = r.role_id')
		->join('JOIN','qs_role_power as rp','r.role_id = rp.role_id')
		->join('JOIN','qs_power as p','rp.power_id = p.power_id')
		->where(['qs_admin.admin_name'=>$uname])
		->asArray()->all();